[
{
"name": "Namor",
"description": "Half-human and half-atlantean, Namor the sub-mariner was one of the earliest superheroes in the Marvel universe. The stereotypical antihero, his short fuse and long list of superpowers would make him a formidable foe.",
"avatar_url": "https://s3.amazonaws.com/superheropediaimages/namor.png"
},
{
"name": "Captain Marvel",
"description": "Whenever he utters the phrase Shazam!, young Billy Batson becomes one of the universe's most versatile superheroes. His list of powers include the wisdom of Solomon, the strength of Hercules, the stamina of Atlas, the power of Zeus, the courage of Achilles, and the speed of Mercury. Known as Earth's mightiest mortal. Captain Marvel is a force to be reckoned with.",
"avatar_url": "https://s3.amazonaws.com/superheropediaimages/captainmarvel.png"
},
{
"name": "Firestorm",
"description": "Unlike other superheroes Firestorm is actually two people that when combined create a superbeing with the ability to rearrange matter on the molecular level. If it weren't for the fact that he were limited to non-organic material he would probably be a lot closer to #1.",
"avatar_url": "https://s3.amazonaws.com/superheropediaimages/firestorm.png"
},
{
"name": "Iron Man",
"description": "Although Iron Man has had his weak moments, his armor has proven itself worthy against the likes of Thor, Hulk, and other superheroes on this list. Also, given that he is constantly evolving we wouldn't be surprised to see him continue crawling up the power charts.",
"avatar_url": "https://s3.amazonaws.com/superheropediaimages/ironman.png"
},
{
"name": "Aqua Man",
"description": "Another Atlantean, Aquaman's powers have at times been underestimated. Anyone that was born in a place capable of literally crushing even the most advanced of human technology is probably going to end up somewhere on this page.",
"avatar_url": "https://s3.amazonaws.com/superheropediaimages/aquaman.png"
},
{
"name": "Dr. Manhattan",
"description": "When it comes to pure, raw, unadulterated power there are few people that come even close to the doctor. In fact, there is almost no defined limit to what he can do. The reason he is at #20 however, is due to his primary weakness (besides tachyons) – apathy. In spite of being able to annihilate essentially the entire universe he just doesn't care enough about much of anything and would prefer to be left alone.",
"avatar_url": "https://s3.amazonaws.com/superheropediaimages/drmanhattan.png"
},
{
"name": "Phoenix",
"description": "As one of the most powerful telepaths in the universe, Jean Grey sometimes has trouble keeping her nearly unlimited mental powers in check. Professor X was even forced to construct psychic shields in her mind as a child in order to prevent her from fully realizing her power until she was mature enough to handle it on her own.",
"avatar_url": "https://s3.amazonaws.com/superheropediaimages/phoenix.png"
},
{
"name": "Captain Atom",
"description": "Essentially a combination of Superman and the Silver Surfer, Captain Atom is sometimes seen as a second rate man-of-steel. His powers are formidable, however, with the ability to manipulate theoretically unlimited amounts of energy.",
"avatar_url": "https://s3.amazonaws.com/superheropediaimages/captainatom.png"
},
{
"name": "Wolverine",
"description": "Although Wolverine doesn't have any of the typical superhero powers, it's the intangibles that put him on the list. What he lacks in raw power he makes up for with pure fury. And as we've seen with Dr. Manhattan, attitude is half the battle.",
"avatar_url": "https://s3.amazonaws.com/superheropediaimages/wolverine.png"
},
{
"name": "Mister Majestic",
"description": "As one of the most powerful superheroes in the Wildstorm universe, Mister Majestic bears a deliberate resemblance to Superman. With essentially all of his powers we just couldn't rank a copy above the man himself.",
"avatar_url": "https://s3.amazonaws.com/superheropediaimages/mistermajestic.png"
},
{
"name": "Professor X",
"description": "As the most powerful telepath in the Universe Professor X has not only been responsible for the training of many other powerful mutants, but for their protection as well.",
"avatar_url": "https://s3.amazonaws.com/superheropediaimages/professorx.png"
},
{
"name": "Wonder Woman",
"description": "Essentially a combination of Superman's power and Batman's fighting skills, the one think keeping Wonder Woman from ranking any higher is her lack of perfect invulnerability. Granted, she can certainly withstand more than her share of blunt force trauma, but a really sharp weapon could do some damage.",
"avatar_url": "https://s3.amazonaws.com/superheropediaimages/wonderwoman.png"
},
{
"name": "Spiderman",
"description": "Spider-Man possesses the proportionate powers of a spider, granted to him from an irradiated spider which bit Peter Parker. The radioactive, complex mutagenic enzymes in the spider's blood that were transferred at the time of the bite triggered numerous body-wide mutagenic changes within Parker, granting him superhuman strength, speed, toughened flesh, and numerous arachnid-like abilities",
"avatar_url": "https://s3.amazonaws.com/superheropediaimages/spiderman.png"
},
{
"name": "Hulk",
"description": "With nearly unlimited strength, rapid tissue regeneration powers, and inexhaustible stamina, fighting against the Hulk is just an all-around bad idea. The main reason he doesn't rank any higher though is due to his lack of other superpowers. While he outranks almost everyone in strength, pure muscle can sometimes only take you so far.",
"avatar_url": "https://s3.amazonaws.com/superheropediaimages/hulk.png"
},
{
"name": "Martian Manhunter",
"description": "Second only to Dr. Manhattan in terms of sheer ability, the Manhunter owns a laundry list of supermanish superpowers. It doesn't stop there though. He also has 9 different senses, powerful telepathic skills, and the ability to regenerate himself.",
"avatar_url": "https://s3.amazonaws.com/superheropediaimages/martianmanhunter.png"
},
{
"name": "The Green Lantern",
"description": "In possession of the most powerful weapon in the universe, the power ring wielded by the green lantern grants him abilities that are seemingly limited only by his imagination. The only real downside is that like any other super cool gadget it has to be recharged, and usually when it's needed most.",
"avatar_url": "https://s3.amazonaws.com/superheropediaimages/greenlantern.png"
},
{
"name": "Flash",
"description": "By tapping into the Speed Force, Wally can run, think, and act faster than light itself. And as impressive as that is, it doesn't end there. He can also move through time, phase through matter, and even read/acquire knowledge at a hyper-accelerated rate.",
"avatar_url": "https://s3.amazonaws.com/superheropediaimages/flash.png"
},
{
"name": "Black Bolt",
"description": "As the king of a certain offshoot of humanity known as the inhumans the Black Bolt has been described even by other superheroes as one of the most powerful beings in the universe. Capable of some serious energy manipulation, the Bolt can use this power to increase any of his abilities to ridiculous levels. His greatest weapon, however, is his thunderous voice. Even a whisper has shown itself capable of shattering the Hulk's bones and it has been said that a shout would destroy an entire planet.",
"avatar_url": "https://s3.amazonaws.com/superheropediaimages/blackbolt.png"
},
{
"name": "Gambit",
"description": "Gambit has the ability to mentally create, control, and manipulate pure kinetic energy to his desire. He is also incredibly knowledgeable and skilled in card-throwing, hand-to-hand combat, and the use of a staff. Gambit is known to charge playing cards and other objects with kinetic energy, using them as explosive projectiles",
"avatar_url": "https://s3.amazonaws.com/superheropediaimages/gambit.png"
},
{
"name": "Green Arrow",
"description": "Green Arrow is a vigilante superhero who fights crime using archery, technology, and martial arts. In his secret identity he is politician and billionaire Oliver Queen, a hot-headed social activist and owner of Queen Industries.",
"avatar_url": "https://s3.amazonaws.com/superheropediaimages/greenarrow.png"
},
{
"name": "Sentry",
"description": "A enigma of sorts, Sentry is so powerful that even he surprises himself with his own abilities at times. His primary weakness, however, is his fragile mind. Although he once wiped his own existence from the memory of every person and superhero in the universe, his personal mental issues are his downfall.",
"avatar_url": "https://s3.amazonaws.com/superheropediaimages/sentry.png"
},
{
"name": "Silver Surfer",
"description": "With this guy, the question is more of what can he not do than what he can. As a result of his ability to tap into the power cosmic he supposedly has access to a nearly unlimited amount of power. The only reason he doesn't rank any higher is because of his inconsistency. Sometimes he seems to like he should be number one, two, and three while at other times we wonder if he should even be on this list. We just averaged the two.",
"avatar_url": "https://s3.amazonaws.com/superheropediaimages/silversurfer.png"
},
{
"name": "Superman",
"description": "With only one weakness the Man of Steel is not fun to fight against. Although he isn't in the #1 spot on our list he easily could be, especially since no one is completely sure of just how powerful Superman really is (he's always holding back). Regardless, as one of the most respected superheroes in the universe this Kryptonian is the real OG.",
"avatar_url": "https://s3.amazonaws.com/superheropediaimages/superman.png"
},
{
"name": "Batman",
"description": "Batman is the super-hero protector of Gotham City, a man dressed like a bat who fights against evil and strikes terror into the hearts of criminals everywhere. Although Batman possesses no super-human powers, he is one of the world's smartest men and greatest fighters. His physical prowess and technical ingenuity make him an incredibly dangerous opponent",
"avatar_url": "https://s3.amazonaws.com/superheropediaimages/batman.png"
},
{
"name": "Thor",
"description": "The Norse God of Thunder, Thor is not only invincible in almost every sense of the word but he takes the meaning of skilled warrior to an entirely new level. Moreover, he has a hammer that gives him almost absolute control over space and time. In fact, this guy is so powerful that it could be a challenge to write a comic that involves him being in any believable amount of danger whatsoever.",
"avatar_url": "https://s3.amazonaws.com/superheropediaimages/thor.png"
}
]